{
  "host": "127.0.0.1",
  "port": 50001,

  "graphics_mode": "bitmap",
  "image_directory": "./images/",

  "background_color": "lightgray",
  "step_color": "turquoise",
  "view_color": "red",

  "start_position": [7,8],
  "board_dimensions": [11,11],
  "bomb_coordinates": [
    [3,3], [0,4]
  ],
    "goal_coordinates": [
    [1,1]
  ],
  "obstacle_coordinates": [
    [7,5], [5,7], [2,2], [1,3],
    [0,0],[1,0],[2,0],[3,0],[4,0],[5,0],[6,0],[7,0],[8,0],[9,0],[10,0],
    [0,1],[0,2],[0,3],[0,4],[0,5],[0,6],[0,7],[0,8],[0,9],[0,10],
    [10,1],[10,2],[10,3],[10,4],[10,5],[10,6],[10,7],[10,8],[10,9],[10,10],
    [1,10],[2,10],[3,10],[4,10],[5,10],[6,10],[7,10],[8,10],[9,10],
    [5,5,"invisible"], [4,5,"invisible"], [3,5,"invisible"], [5,4, "invisible"], [6,5,"invisible"]
  ],
  "weights": {
    "1,1": 10.0, "2,1": 10.0,"3,1":10.0, "4,1": 10.0, "5,1": 10.0, "6,1": 10.0,
    "1,2": 10.0, "2,2": 1.2, "3,2": 1.3, "4,2": 1,    "5,2": 1,    "6,2": 1,
    "1,3": 10.0, "2,3": 5.3, "3,3": 10,  "4,3": 1,    "5,3": 1,    "6,3": 1,
    "1,4": 3.5 , "2,4": 1,   "3,4": 1.1, "4,4": 1.2,  "5,4": 1,    "6,4": 1,
    "1,5": 10 ,  "2,5": 1,   "3,5": 1,   "4,5": 1,    "5,5": 1,    "6,5": 1
      },

  "use_maps?": true,
  "object_dictionary": {
    " ": "free space",
    "O": "visible obstacle",
    "I": "invisible obstacle",
    "B": "bomb",
    "G": "goal",
    "A": "agent start position (only 1)"
  },
  "object_map":[
    "OOOOOOOOOOOOOOO",
    "O     OO   O  O",
    "OG     O   O  O",
    "O      O   O  O",
    "O      O      O",
    "O      O      O",
    "O      O  B   O",
    "OOOO          O",
    "O   IIII      O",
    "O  B     A    O",
    "OOOOOOOOOOOOOOO"
  ],
  "weight_dictionary": {
    "1": 1,
    "2": 2,
    "3": 5,
    "4": 10,
    "R": "random"
  },
  "weight_map" : [
    "111111141111111",
    "112111111111141",
    "1121111RRRR1111",
    "1111111131R1111",
    "111R11113331111",
    "111111113111111",
    "111411113111211",
    "111411111112111",
    "111411111111111",
    "111411444111411",
    "111RRRRRRRRRR11"
  ]
}
